In [1]:
import numpy as np
import pandas as pd

## 创建索引

### 范围索引

In [2]:
pd.Series(data=np.random.randint(400, 1000, 12), index=pd.RangeIndex(1, 13, name="月份"))

月份
1     804
2     929
3     419
4     466
5     990
6     801
7     783
8     551
9     661
10    742
11    549
12    510
dtype: int32

### 分类索引

In [3]:
cate_index = pd.CategoricalIndex(
    ['苹果', '香蕉', '苹果', '苹果', '桃子', '香蕉'],
    ordered=True,
    categories=['苹果', '香蕉', '桃子']
)
categorical_idx_ser=pd.Series(data=range(6), index=cate_index)

In [4]:
categorical_idx_ser.groupby(level=0, observed=False).sum()

苹果    5
香蕉    6
桃子    4
dtype: int64

### 多级索引

In [5]:
# from_product方法通过第一个参数的两组数据的笛卡尔积，构造了多级索引。
multi_index = pd.MultiIndex.from_product(
    (np.arange(1001, 1006), ["期中", "期末"]), names=["学号", "学期"]
)
multi_index_df = pd.DataFrame(
    data=np.random.randint(60, 101, (10, 3)),
    columns=["语文", "数学", "英语"],
    index=multi_index,
)

multi_index_df

          语文  数学  英语
学号   学期
1001 期中   77  90  94
     期末   76  74  98
1002 期中  100  82  98
     期末   95  71  89
1003 期中   74  76  83
     期末   64  85  96
1004 期中   80  72  62
     期末   92  61  67
1005 期中   79  92  63
     期末   97  60  90

In [6]:
# 计算每个学生的成绩，期中占25%，期末占75%
multi_index_df.groupby(level=0).agg(lambda x: x.values[0] * 0.25 + x.values[1] * 0.75)

         语文     数学     英语
学号
1001  76.25  78.00  97.00
1002  96.25  73.75  91.25
1003  66.50  82.75  92.75
1004  89.00  63.75  65.75
1005  92.50  68.00  83.25

### 日期时间索引

In [7]:
# 间隔10天
date_range_periods_10 = pd.date_range("2021-1-1", "2021-6-1", periods=10)
date_range_periods_10

DatetimeIndex(['2021-01-01 00:00:00', '2021-01-17 18:40:00',
               '2021-02-03 13:20:00', '2021-02-20 08:00:00',
               '2021-03-09 02:40:00', '2021-03-25 21:20:00',
               '2021-04-11 16:00:00', '2021-04-28 10:40:00',
               '2021-05-15 05:20:00', '2021-06-01 00:00:00'],
              dtype='datetime64[ns]', freq=None)

In [8]:
# 间隔一星期
date_range_periods_week = pd.date_range("2021-1-1", "2021-6-1", freq="W")
date_range_periods_week

DatetimeIndex(['2021-01-03', '2021-01-10', '2021-01-17', '2021-01-24',
               '2021-01-31', '2021-02-07', '2021-02-14', '2021-02-21',
               '2021-02-28', '2021-03-07', '2021-03-14', '2021-03-21',
               '2021-03-28', '2021-04-04', '2021-04-11', '2021-04-18',
               '2021-04-25', '2021-05-02', '2021-05-09', '2021-05-16',
               '2021-05-23', '2021-05-30'],
              dtype='datetime64[ns]', freq='W-SUN')

In [9]:
date_range_periods_week - pd.DateOffset(days=2)

DatetimeIndex(['2021-01-01', '2021-01-08', '2021-01-15', '2021-01-22',
               '2021-01-29', '2021-02-05', '2021-02-12', '2021-02-19',
               '2021-02-26', '2021-03-05', '2021-03-12', '2021-03-19',
               '2021-03-26', '2021-04-02', '2021-04-09', '2021-04-16',
               '2021-04-23', '2021-04-30', '2021-05-07', '2021-05-14',
               '2021-05-21', '2021-05-28'],
              dtype='datetime64[ns]', freq=None)

## 修改索引

In [10]:
add_index_df = pd.DataFrame(
    data=np.random.randint(1, 10, (5, 3)),
    columns=["语文", "数学", "英语"],
    index=[1001, 1002, 1003, 1004, 1005],
)
add_index_df

      语文  数学  英语
1001   3   7   6
1002   9   7   3
1003   7   5   6
1004   6   5   9
1005   9   5   3

### 替换为新的index ----set_index

In [11]:
new_index=add_index_df.set_index(["语文"])
new_index

    数学  英语
语文
3    7   6
9    7   3
7    5   6
6    5   9
9    5   3

### 重置索引

In [12]:
new_index.reset_index()

   语文  数学  英语
0   3   7   6
1   9   7   3
2   7   5   6
3   6   5   9
4   9   5   3

## 查看索引

### 获取当前索引

In [ ]:
df1.index

Index([1001, 1002, 1003, 1004, 1005, 1006, 1007, 1008, 1009, 1010], dtype='int64')

### 获取极值的 index

In [ ]:
# 获取语文最高分的index
df1["语文"].idxmax()

1001

### 获取指定值的 index

In [ ]:
# 找到语文分数等于9的学生所在行的索引的具体数字部分
df1[df1["语文"] == 9].index.tolist()

[1001, 1007]

## 访问数据

In [13]:
df1 = pd.DataFrame(
    data=np.random.randint(1, 10, (10, 3)),
    columns=["语文", "数学", "英语"],
    index=[1001, 1002, 1003, 1004, 1005, 1006, 1007, 1008, 1009, 1010],
)
df1

      语文  数学  英语
1001   9   7   4
1002   5   6   5
1003   6   5   3
1004   3   2   1
1005   6   1   4
1006   3   7   9
1007   9   7   1
1008   7   9   1
1009   8   8   7
1010   2   6   2

### 访问单行/列

返回值为 pandas.core.series.Series

#### 按列名访问 []

In [14]:
df1.语文

1001    9
1002    5
1003    6
1004    3
1005    6
1006    3
1007    9
1008    7
1009    8
1010    2
Name: 语文, dtype: int32

In [15]:
df1["语文"]

1001    9
1002    5
1003    6
1004    3
1005    6
1006    3
1007    9
1008    7
1009    8
1010    2
Name: 语文, dtype: int32

In [16]:
type(df1["语文"])

pandas.core.series.Series

##### 访问多列 [[]]

In [17]:
df1[["语文", "数学"]]

      语文  数学
1001   9   7
1002   5   6
1003   6   5
1004   3   2
1005   6   1
1006   3   7
1007   9   7
1008   7   9
1009   8   8
1010   2   6

#### 按行访索引问 iloc

In [18]:
# 第一行
df1.iloc[0]

语文    9
数学    7
英语    4
Name: 1001, dtype: int32

In [19]:
# 最后一行
df1.iloc[-1]

语文    2
数学    6
英语    2
Name: 1010, dtype: int32

In [20]:
 # 第一行 
df1.iloc[0,:]

语文    9
数学    7
英语    4
Name: 1001, dtype: int32

#### 按行名称访问 loc

loc的两个参数，一个表示行，一个表示列

In [21]:
df1.loc[1004]

语文    3
数学    2
英语    1
Name: 1004, dtype: int32

In [22]:
df1.loc[[1001, 1004]]

      语文  数学  英语
1001   9   7   4
1004   3   2   1

In [23]:
df1.loc[1004]["语文"]

3

In [24]:
df1.loc[1004, "语文"]

3

In [25]:
df1.loc[1004].语文

3

### 访问行+列

返回值为 pandas.core.frame.DataFrame

#### 访问尾部

In [26]:
df1_tail=df1.tail(2)

In [27]:
type(df1_tail.tail())

pandas.core.frame.DataFrame

In [28]:
# 使用tail获取最后一行的index
df1_tail.index[0]

1009

#### 访问头部

In [29]:
df1.head(2)

      语文  数学  英语
1001   9   7   4
1002   5   6   5

## 筛选/修改

### 筛选

#### 表达式

In [30]:
# 列出英语大于90分的
df1[df1.英语 > 8]

      语文  数学  英语
1006   3   7   9

In [31]:
# 两个筛选条件
df1[(df1.英语 > 8) & (df1.数学 > 3)]

      语文  数学  英语
1006   3   7   9

#### query函数

In [32]:
df1.query("英语>8")

      语文  数学  英语
1006   3   7   9

In [33]:
df1.query("语文==6")

      语文  数学  英语
1003   6   5   3
1005   6   1   4

In [34]:
df1.query("英语>8 and 语文==3")

      语文  数学  英语
1006   3   7   9

In [35]:
df1.query("英语<语文")

      语文  数学  英语
1001   9   7   4
1003   6   5   3
1004   3   2   1
1005   6   1   4
1007   9   7   1
1008   7   9   1
1009   8   8   7

In [36]:
df1.query("英语 in [3,4]")

      语文  数学  英语
1001   9   7   4
1003   6   5   3
1005   6   1   4

In [37]:
# 引用变量 使用@作为前缀即可
a_list=[3,4]
df1.query("英语 in @a_list")

      语文  数学  英语
1001   9   7   4
1003   6   5   3
1005   6   1   4

In [38]:
df1.query("英语 == @a_list[1]")

      语文  数学  英语
1001   9   7   4
1005   6   1   4

#### 索引切片
不同类型的索引,使用索引切片会有不同的效果

* 数字索引: 范围访问
* 时间索引: 时间日期范围访问

In [47]:
new_index = add_index_df.set_index(["语文"])
new_index

    数学  英语
语文
3    7   6
9    7   3
7    5   6
6    5   9
9    5   3

In [53]:
# 前2个
new_index[0:2]

    数学  英语
语文
3    7   6
9    7   3

### 修改

#### 简单修改

In [39]:
df = pd.DataFrame({"a": [1, 2, 3], "b": [11, 22, 33]})
df

   a   b
0  1  11
1  2  22
2  3  33

In [40]:
# 新增列
df["c"] = "xx"
df

   a   b   c
0  1  11  xx
1  2  22  xx
2  3  33  xx

In [41]:
# 添加一列
df["e"] = ["x", "y", "z"]
df

   a   b   c  e
0  1  11  xx  x
1  2  22  xx  y
2  3  33  xx  z

In [42]:
df.loc[:, ["f"]] = "ff"
df

   a   b   c  e   f
0  1  11  xx  x  ff
1  2  22  xx  y  ff
2  3  33  xx  z  ff

#### 筛选并修改

In [43]:
# 根据loc的知识我们可知，loc的两个参数，一个表示行，一个表示列
# (df1.英语 > 8) 表示搜索行 ["good_student","student_tag"] 表示两列
df1.loc[(df1.英语 > 8), ["good_student", "student_tag"]] = (1, "good_student_tag")
df1

      语文  数学  英语  good_student       student_tag
1001   9   7   4           NaN               NaN
1002   5   6   5           NaN               NaN
1003   6   5   3           NaN               NaN
1004   3   2   1           NaN               NaN
1005   6   1   4           NaN               NaN
1006   3   7   9           1.0  good_student_tag
1007   9   7   1           NaN               NaN
1008   7   9   1           NaN               NaN
1009   8   8   7           NaN               NaN
1010   2   6   2           NaN               NaN